/**
 * @license
 * Copyright 2025 Google LLC
 * SPDX-License-Identifier: Apache-2.0
 */

// Modificado por Nexo, 2025
// Baseado em gemini-cli (Copyright 2025 Google LLC, Apache 2.0)
// Parte do NexoCLI_BaseGemini - Personalização para ecossistema Nexo

export const shortAsciiLogo = `
 ███   ██ ████████ ██   ██  ██████   ██████ ██      ██ 
 ████  ██ ██        ██ ██  ██    ██ ██      ██      ██ 
 ██ ██ ██ █████      ███   ██    ██ ██      ██      ██ 
 ██  ████ ██        ██ ██  ██    ██ ██      ██      ██ 
 ██   ███ ████████ ██   ██  ██████   ██████ ███████ ██ 
`;

export const longAsciiLogo = `
 ███   ██ ████████ ██   ██  ██████   ██████ ██      ██ 
 ████  ██ ██        ██ ██  ██    ██ ██      ██      ██ 
 ██ ██ ██ █████      ███   ██    ██ ██      ██      ██ 
 ██  ████ ██        ██ ██  ██    ██ ██      ██      ██ 
 ██   ███ ████████ ██   ██  ██████   ██████ ███████ ██ 

    🔧 NexoCLI - Personalização do Gemini-CLI para ecossistema Nexo
`;
